Repository: Lilium27/Creating-Intelligent-Content-with-Lightweight-DITA-Translation-Project
Catalog: omegat/project_save.tmx
Source language: en
Languages: zh_cn

source: The standard was being split into three different versions for its 1.3 release: base, technical content, and all-inclusive, which were called “packages” or “packaging” in discussions before their official release.
zh_cn: DITA 标准1.3版本分为三个不同的分支：基础版本、技术内容版本和完整版本，在正式发布之前的讨论中这三个分支被称为“包”或者“打包”。

source: The standard's “fully tested DTD or schema for XML-based authoring” includes commonly used elements or moves in technical publication.
zh_cn: DITA 标准“是一种经过充分检验的用于 XML 创作的 DTD 或模式”的含义表示 DITA 包含了技术出版物中常用的元素或操作。

source: The standards set guidelines and rules for structuring and processing content or information.
zh_cn: 这些标准为组织和处理内容或信息设定了指导方针和规则。

source: The structure of PQTI is built around a list of quality requirements, and a standard pattern of presenting two examples when discussing each requirement: one showing a common error and the second illustrating a way to correct the error and “improve quality.”
zh_cn: PQTI 的结构就是围绕着质量要求列表构建的，当谈论每个要求时，标准模式都需要展示两个示例：一个是常见错误，另一个则展示如何纠正错误并“提高质量。”

source: The subcommittee evaluated the possibility of presenting several ways to represent the most useful DITA components for broader categories of authors.
zh_cn: 小组委员会评估了为更多种类作者提供几种代表最实用DITA组件方法的可能性。

source: The subcommittee considered mappings to AsciiDoc, reStructuredText, EPUB3, Microsoft Word, and JSON.
zh_cn: 小组委员会还考虑了 AsciiDoc、reStructuredText、EPUB3、Microsoft Word 和J SON 格式的映射。

source: The subcommittee maintains a wiki page with a growing list of LwDITA-aware tools (i.e., tools that can validate and enforce the syntax guidelines and rules presented in this book and/or include templates for creating content in the LwDITA authoring formats)4.
zh_cn: 小组委员会维护一个包含支持LwDITA的工具的维基页面，这个列表还在不断增长(例如，能够验证和执行本书中介绍的语法指导方针和规则的工具，以及/或包含用于创建LwDITA创作格式内容的模板。)4.

source: The subcommittee was approved by the OASIS leadership on July 22, 2014 and Priestley was appointed as chair.
zh_cn: 2014年7月22日，OASIS 领导层批准成立该小组委员会，并任命普里斯特利为主席。

source: The subcommittee's work was also influenced by the independent release of an open source tool that allowed the processing of Markdown files as DITA topics.
zh_cn: 小组委员会的工作还受到一个独立发行的开源工具的影响，该工具可以将 Markdown 文件转换为 DITA 话题。

source: The system can be applied to production of books for selfinstruction or to the specification of data bases for computer-aided instruction.
zh_cn: 该系统可用于制作自学书籍，也可用于规范计算机辅助教学的数据库。

source: The tags required for declaring the list, its entries, terms, and descriptions do not look extremely lightweight.
zh_cn: 声明列表及其条目、术语和描述所学的标签并不轻量。

source: The technical content edition adds the technical communication content types (concept, task, reference) that defined DITA in its origins at IBM, and adds the content types of glossary entry, glossary group, and troubleshooting.
zh_cn: 技术内容版添加了在IBM的起源中定义DITA的技术通信内容类型(概念、任务、引用)，并添加了术语表条目、术语表组和故障诊断的内容类型。

source: The theoretical axis of the evolution of DITA analyzed in this book is based on the concept of computational thinking, which is defined by their main proponents as follows:
zh_cn: 本书分析 DITA 的发展历程依赖的理论轴心是计算机思维，计算机思维的主要支持者对其定义如下：

source: The third line opens the actual topic (with the required attribute for a unique identifier value: “pedro-bio” in this case).
zh_cn: 第三行则是主题的实际开头(使用惟一标识符值所需的属性：在本例中为“pedroo -bio”)。

source: The third topic reference is the “about” page with Chef Pedro's information, which I introduced in Chapter 2 and reproduce in Figure 5.4.
zh_cn: 第三个话题引自“关于”页面，展示厨师佩德罗的信息，我在第2章中介绍过该页面，见图5.4。

source: The three authoring formats, or flavors, included in the initial release of LwDITA are not definitive and could expand to include additional lightweight markup languages based on audience feedback and interest from current or future members of the subcommittee.
zh_cn: LwDITA最初版本中包含的三种创作格式(或风格)并不是最终定版，它可以根据用户反馈和小组委员会当前或未来成员的兴趣扩展到包括其他轻量级标记语言。

source: The three key aspects of Carroll's minimalist approach to instruction are the following:
zh_cn: Carroll的极简主义方法有如下三个方面：

source: The title component in this revised example includes the XML tags that represent the <title> element and the actual content for human users that appears inside the tags.
zh_cn: 在经过修正的示例中，标题组件包括表示 <title> 元素的 XML 标签，提供给用户的实际内容包含在标签之内，

source: The title is marked by a heading 1 in atx syntax.
zh_cn: 由 atx 语法编写。

source: The title of Carroll's influential book refers “to the legendary Funnel of Nurnberg, said to make people wise very quickly” (1990, p.
zh_cn: 卡罗尔所著的这本颇有影响力的书享有“传奇《纽伦堡漏斗》能让你瞬间开悟”的盛誉 (1990, p.

source: The tools might be different, but the principles are the same.
zh_cn: 尽管用到的工具可能不同，但原理是相同的。

source: The topic works as a simple template that separates content from presentation and leaves it ready to join a topic collection and be integrated into information products.
zh_cn: 主题是一个简单的模板，将内容与形式分离，并且随时可以加入主题集从而集成进信息产品中。

source: The topic's first line is the XML declaration that, as I tell my students, announces to the computing processors that the topic is an XML file and should be treated as such.
zh_cn: 正如我告诉我的学生的那样，主题的首行XML声明，它告诉计算机此主题是一个XML文件，并且应该按XML文件处理。

source: The transformation of DQTI guidelines into DITA elements was subtly documented in a 2001 article published in the “Technology Review” column of the journal Technical Communication.
zh_cn: 《技术传播》杂志《技术评论》专栏在2001年发表的一篇的文章中细致地记载了DQTI指导方针转化为DITA元素的过程。

source: The unordered list (<ul>) is a very similar component.
zh_cn: 无序列表组件 (<ul>) 与有序列表组件类似。

source: The validation of Markdown files as MDITA topics will also be application-specific.
zh_cn: 验证 Markdown 格式的 MDITA 话题，也需要使用特定软件。

source: The validation process of an HTML5 file as an HDITA topic will be application-specific, as HTML does not have a customizable document type definition or schema syntax.
zh_cn: 验证 HTML5 格式的 HDITA 话题，需要使用特定软件，因为 HTML 没有特定的文档类型定义和模式语法。

source: The value for the --input argument directs the DITA-OT to the specific folder where you stored the marinara-critique.ditamap file (the path-to-file section of the command, which you should replace with the actual path to the file in your computer).
zh_cn: --input 后参数的值将 DITA-OT 定向到存储marinara-critique.ditamap 文件的特定文件夹（你应该用计算机中文件的实际路径替换命令中的path-to-file部分）。

source: The values for the domains attribute, in bold, give constraining instructions to processors.
zh_cn: “domains”属性的值是粗体，可以向处理器提供约束指令。

source: The video tutorials “Installing the DITA Open Toolkit”2 and “Testing the DITA Open Toolkit”3 provide enough information to follow the examples included in this book.
zh_cn: 视频教程“安装 DITA Open Toolkit”2和“测试 DITA Open Toolkit”3提供了足够的信息来学习本书接下来展示的示例。

source: The workplace still needs thinkers and curators of automated content, and technical communication programs in academia should be preparing students for those positions and for conducting research that will advance and improve intelligent content concepts and practices.
zh_cn: 技术传播领域仍然需要思考者和自动化内容管理者，而学术界的技术传播课程应该让学生为这些职位做好准备，为以推进和改进智能内容的概念和实践的研究做好准备。

source: The “Learning to Think Like a Computer” article from The New York Times that I mentioned earlier in this chapter included a relevant example provided by Dan Garcia, from the University of California, Berkeley.
zh_cn: 我在本章前面提到了《纽约时报》上的一篇题为《学会像电脑一样思考》的文章，文章介绍了加州大学伯克利分校的丹·加西亚（Dan Garcia）提供的一个相关例子。

source: The “death” of the manual as the default genre of technical communication has impacted the field in more than one way.
zh_cn: 手册不再作为技术传播的默认体裁对这一领域造成的影响是多方面的。

source: The “format free” characteristic of intelligent content (Rockley et al., 2015) depends on the separation of content and presentation; after all, this sample topic can be transformed to different deliverables with a variety of formats and stylesheets.
zh_cn: 智能内容的“无格式”特征 (Rockley et al., 2015) 依赖内容与形式的分离，同样的话题可以转换为具有各种格式和样式的交付文件。

source: The “future” of technical communication described in the Adobe video focuses on what Rebekka Andersen describes as “structured content that is highly adaptable and portable and can be configured on the fly in response to specific user requests” (2014, p.
zh_cn: Adobe 视频中所描述的技术传播的“未来”关注的是瑞贝卡·安德森（Rebekka Andersen）所描述的“具有高度适应性和可移植性，并且可以根据用户的具体要求随时进行配置的结构化内容” （2014年， 第

source: The “layers of abstraction identified to introduce concepts of component content management, structured authoring, and DITA from a computational thinking and genre theory perspective (Evia et al., 2015, p.
zh_cn: “抽象层级从计算机思维和体裁理论的角度出发

source: The “lightweight” adjective in the proposed standard's name does not imply a direct equivalency to lightweight markup languages.
zh_cn: 名称中的形容词“轻量级”并不直接等同于轻量级标记语言。

source: The “minimize mixed content” rule also relaxes the content reuse mechanisms of DITA XML: In DITA, for example, content from a command (<cmd>) inside a task step (<step>) can only be reused in another command inside a step, but in XDITA and HDITA a command is expressed as a simple paragraph (<p>) that can be reused wherever paragraphs are allowed.
zh_cn: “最小化混合内容”规则也简化DITA XML的内容复用机制：例如，在DITA中来自一个命令 （<cmd>）的内容在一个任务的步骤(步骤> <)只能使用

source: The “minimize mixed content” rule in LwDITA wraps content from the list items in paragraphs.
zh_cn: 根据 LwDITA 中“最小化混合内容”的原则，列表项内容会被包裹在段落标签中。

source: The “minimize mixed content” rule forces authors to wrap the content of each list item in paragraphs.
zh_cn: “最小化混合内容”原则要求创作者将每个列表项内容都包裹在段落标签中。

source: The “red squiggly of doom” from Figure 6.2 indicates that, according to the XDITA grammar rules, a topic cannot be empty.
zh_cn: 根据 XDITA 语法规则，图6.2中的“预示着坏消息的红色曲线”表示话题内容不能为空。

source: The structured recipe keeps content organized and should help computers understand and manipulate elements and attributes.
zh_cn: 这个结构化的菜谱内容组织有序，有助于计算机理解并操作元素和属性。

source: The title is marked by a heading 1 in setext syntax.
zh_cn: 其中标题使用一级标题表示，由 setext 语法编写。

source: The definition list element does not exist in GitHub Flavored Markdown syntax.
zh_cn: 该定义列表不是用 GitHub 风格的 Markdown 语法编写的，

source: Their proposed solution was, as we know by now, the Darwin Information Typing Architecture.
zh_cn: 正如我们现在所知，他们提出的解决方案是达尔文信息类型体系结构。

source: Their recommended plan sheets were to be initially completed by subject-matter experts (actually, the authors said that writers should “use” subject-matter experts, with awareness that the experts “are busy people”), who would provide information “in a form that is close to the coherent pattern you will use in writing the manual.
zh_cn: 他们推荐的计划表将由主题专家（实际上，作者称创作者应当“善用”主题专家，并意识到专家们“工作繁忙”）起草完成，他们提供信息的形式类似于你运用在手册中的一致性模式

source: Then, I emphasize an important rule that affects some common content components in XDITA and HDITA.
zh_cn: 然后强调一个影响XDITA和HDITA中一些通用内容组件的重要规则。

source: Then, as the layers are recombined, they work together to solve the problem at hand, much like an algorithm.
zh_cn: 然后当这些层级被重新组合时，它们共同作用来解决手头的问题，就像算法一样。

source: Then, as the layers are recombined, they work together to solve the problem in a process that can be represented as a replicable algorithm.
zh_cn: 然后当这些层级被重新组合时，它们共同作用来解决问题，这个过程可以用一个算法来表示。

source: Then, some of the topical conventions included in the XML tags are equivalent to the essential moves of technical communication from Table 2, including <shortdesc> as a staging move and <step> as a coaching move.
zh_cn: XML标记中包含的一些主题惯例等同于表2中技术传播中的基本文步，包括作为筹划文步的<shortdesc> ，作为指导文步的<step> 。

source: Then, the chapter explains the need for a simplified version of DITA that allows authors to contribute to intelligent content ecosystems writing in markup languages that do not require complex XML structures.
zh_cn: 然后，本章解释了用户对简化版 DITA 的需求，借助简化版 DITA 创作者可以编写基于标记语言的智能内容生态系统，而无需使用复杂 XML 结构。

source: Then, the map includes links (<topicref>) for the individual files needed for the website.
zh_cn: 然后，该地图包含网站所需的各个文件的链接（<topicref>）。

source: Then, they can save the file as sensei-brochure.html.
zh_cn: 然后，他们可以将文件保存为 sensei-brochure.html。

source: Then, you can save the file as sen- sei-brochure.ditamap.
zh_cn: 然后，你可以将文件保存为 sen- sei-brochure.ditamap。

source: There are jokes in DITA circles about the draconian nature of DITA-OT error messages.
zh_cn: 在 DITA 圈子里有一些关于 DITA-OT 报错信息的玩笑话。

source: There can be some instances of the <step> element with a <cmd> for a command in each step, but things get quite complicated when Pedro looks at all the available elements in a task topic2, which include the following: <taskbody>, <prereq>, <context>, <steps>, <steps-informal>, <steps- unordered>, <step>, <stepsection>, <cmd>, <info>, <substeps>, <substep>, <stepxmp>, <choicetable>, <chhead>, <choptionhd>, <chdeschd>, <chrow>, <choption>, <chdesc>, <choices>, <steptroubleshooting>, <stepresult>, <tutorialinfo>, <tasktroubleshooting>, <result>, and <postreq>.
zh_cn: 可能会用上一些 <step> 元素，并在每个步骤中使用 <cmd> 元素表示命令。但当佩德罗查看任务（task）话题2中的所有可用元素时，事情变得相当复杂，这些元素包括：<taskbody>, <prereq>, <context>, <steps>, <steps-informal>, <steps- unordered>, <step>, <stepsection>, <cmd>, <info>, <substeps>, <substep>, <stepxmp>, <choicetable>, <chhead>, <choptionhd>, <chdeschd>, <chrow>, <choption>, <chdesc>, <choices>, <steptroubleshooting>, <stepresult>, <tutorialinfo>, <tasktroubleshooting>, <result>, and <postreq>。

source: There is no direct equivalent for a definition list in MDITA core profile, although some Markdown flavors do have a way to represent this component.
zh_cn: 尽管使用 Markdown 语法确实可以表示出定义列表，但在 MDITA 的核心定义中，没有与定义列表直接对应的组件。

source: There's no business model for that.”
zh_cn: 不存在这样的商业模式”

source: Therefore, Carroll is also “blamed” for the development of DITA.
zh_cn: 因此，卡罗尔也被称为DITA发展的“罪魁祸首”。

source: Therefore, LwDITA can be described as a resource to mend some aspects of the research-to-practice loop in our discipline.
zh_cn: 因此，在我们的领域中，轻量级DITA能够弥合从研究到实践这一环路上出现一些问题。

source: Therefore, a DITA-aware tool with a graphical user interface (GUI) can be a better experience for novice DITA authors.
zh_cn: 因此，对于 DITA 初学者来说，具有图形用户界面（GUI）的 DITA 工具可能带来更好的体验。

source: Therefore, identifying genre conventions in this text was not as direct as it was in other how-to titles about creating documentation.
zh_cn: 因此，在这本书中确定体裁惯例并不像在介绍如何创作文档的标题中那样直接。

source: Therefore, instead of following a rigid content development workflow (e.g., Bailie & Urbina's model), students focused on the quadrant of collection (creating or gathering content), while we assumed that elements of information technology (tools support, processing), management (deadlines and supervision), and design (templates and stylesheets) were the instructors' responsibility and were just briefly discussed in class.
zh_cn: 因此，学生的关注点聚焦在“聚合”象限（创建或聚合内容），而不是遵循僵硬的内容开发工作流（如拜利和厄比纳的模型）。同时我们认为教授信息技术元素（使用工具、处理文件）、管理技能（管理时限和监管进程）、设计技能（制作模板和样式表）是教师的责任，但这些内容只在课堂进行了简要地讨论。

source: Therefore, it was a surprise when Priestley sent a message to the DITA Technical Committee on October 23, 2012 announcing a merger of sorts between DITA and Information Mapping for the Lightweight DITA proposal.
zh_cn: 因此，当普里斯特利在2012年10月23日向 DITA 技术委员会宣布 DITA 和信息映射将在轻量级 DITA 提案中合并时，大家都感到很惊讶。

source: Therefore, structured writing is not the enemy of professional writers, but a natural and proper part of their professional tool chest.
zh_cn: 因此，结构化写作并非职业文档工程师的敌人，而是他们职业工具宝箱中自然而恰当的一员。

source: Therefore, the @id for franchise-intro.md, if needed for future topic linking and reuse, will be franchise-intro.
zh_cn: 因此，为了在以后链接和复用文件， franchise-intro.md文件的@id会自动设置为 franchise-intro。

source: Therefore, this is unequivocally a book about DITA, but it is not a detailed introduction and how-to to the widely adopted XML-based DITA standard (for comprehensive introductory texts to DITA XML, see Hackos, 2011; Bellamy et al., 2012).
zh_cn: 因此毫无疑问，本书是一本关于 DITA 的书，但是书中没有详细介绍被广泛使用的基于 XML 的 DITA 标准（全面介绍基于 XML 的 DITA 的文本，请参阅哈克斯，2011年；贝拉米等，2012年）。

source: Therefore, whereas a valid HTML5 file requires a <title> element, this component won't perform as the topic's first heading.
zh_cn: 因此，尽管一个有效的 HTML5 文件需要一个 <title> 元素，但该组件不会成为话题内容的第一个标题。

source: These abstractions hide the layers that authors do not need to know until they move to a more advanced layer.
zh_cn: 抽象隐藏了一些层级，这些层级是创作者在转移到更高层级之前无需知道的。

source: These features and benefits contribute to DITA's popularity and adaptability as an intelligent content solution for technical communication.
zh_cn: 这些特性和优势有助于提升 DITA 作技术传播智能内容解决方案的流行度和适应性。

source: These guidelines apply to the elements.”
zh_cn: 这些指导方针适用于元素。”

source: These guidelines apply to the elements.” Further describing the difference between characteristics and elements, Hargis noted that “writers cannot, for example, turn clarity on and off with a markup tag.
zh_cn: 这些指导方针适用于元素。”在进一步描述特征和元素之间的区别时，哈吉斯指出:“例如，不是说作者用了标记文档就一定具有明确性。”

source: These layers of abstraction are not necessarily new to the field of technical communication (they include long-discussed concepts and principles like separating content from design, and planning for single-sourcing and content reuse, among others), but are essential building blocks of intelligent content solutions that are still not fully embraced in academia.
zh_cn: 抽象层级对技术传播领域来说不一定是新鲜的观点（抽象层级的概念包括讨论各种已久的概念和原则，如将内容与设计分离、同源规划和内容重用等），但在学术界还没有完全接受智能内容解决方案基本构建块的概念。

source: These models of a content-development process establish concrete stages, decisions, and activities that can be linked to the ISTE indicators for assessing computational thinking and describing the layers of abstraction in the process of creating intelligent content with LwDITA.
zh_cn: 内容开发过程模型包括与 ISTE 指标相联系的具体阶段、决策过程和实践活动，可以用于评估计算机思维能力，描述使用 LwDITA 创建智能内容过程中出现的抽象层级。

source: These moves included advocating for task-oriented titles and headings in sections and the use of the term “topic” (years before the development of a DITA topic model) as a component in a “library” of information units that a writer used to assemble documentation deliverables.
zh_cn: 这些文步包括倡导在章节中使用面向任务的标题，并使用术语“主题”(在开发DITA主题模型之前的几年)作为信息单元“库”中的组件，编者使用这些信息单元来组装文档交付物。

source: These professionals are welcome to try LwDITA as a content-creation alternative; however, they are not the intended audience for the proposed simplified standard.
zh_cn: 他们乐于尝试使用 LwDITA 作为内容创建的替代方案，然而，他们并不是提议的简化标准的目标受众。

source: These users can be casual content contributors (e.g., a subject matter expert who authors short topics that a technical author will later integrate into a larger DITA collection) or authors who are not working with DITA XML (e.g., marketing professionals creating intelligent content for multi- channel publishing, or even technical writers who prefer to write in HTML or Markdown).
zh_cn: 这些用户可能是临时的内容贡献者（比如，编写简短的话题的主题专家，这些话题将由技术文档工程师整合成一个更大的 DITA 集合）或作者不使用 DITA XML（例如，创建可以多渠道发布的智能内容的营销专业人士，甚至是喜欢用 HTML 或 Markdown 的技术写作人员）。

source: These users can be casual content contributors (e.g., a subject matter expert who authors short topics that a technical author will later integrate into a larger DITA collection) or authors who are not working with DITA XML (e.g., marketing professionals creating intelligent content for multichannel publishing, or even technical writers who prefer to write in HTML or Markdown). Chapter 4 identifies additional user types for the three initial authoring formats of LwDITA.
zh_cn: 这些用户可能是临时的内容贡献者（比如，编写简短的话题的主题专家，这些话题将由技术文档工程师整合成一个更大的 DITA 集合）或作者不使用 DITA XML（例如，创建可以多渠道发布的智能内容的营销专业人士，甚至是喜欢用 HTML 或 Markdown 的技术写作人员）。第4 章介绍了LwDITA的三种初始创作格式的其他用户类型。

source: They advocated for the use of a series of plan sheets that functioned as the manual's blueprint: “Just as a house should not be built without a blueprint, a manual should not be created without a blueprint - not just an outline, but a blueprint” (1984, p.12).
zh_cn: 他们建议使用一系列计算表作为手册蓝图：“就像建房子不能没有蓝图，手册也不应没有蓝图 - 不只是大纲，而是蓝图。” (1984, p.12).

source: They also come from my roles as co-chair of the Lightweight DITA subcommittee with OASIS and co-editor of the technical specification for the LwDITA standard.
zh_cn: 也来自于我担任 OASIS 轻量级 DITA 小组委员会联合主席和 LwDITA 标准技术规范联合编辑的经验。

source: They are also based on the LwDITA authoring formats described in Chapter 4, which embrace the diversity of tools used by content creators across disciplines and professional
zh_cn: 它们还支持第四章中介绍的 LwDITA 写作格式，涵盖了跨学科和跨专业的内容创建者使用的

source: They could also use a more advanced HTML editor, including WYSIWYG editors (as long as they allow users to save content as standards- compliant HTML5), or a LwDITA-aware tool like Oxygen XML Editor.
zh_cn: 他们也可以使用更高级的 HTML 编辑器，包括 WYSIWYG 编辑器（只要该编辑器允许用户将内容保存为符合标准的 HTML5 文件），或者支持 LwDITA 的工具，比如 Oxygen XML Editor。

source: They presented the possibility of online documentation as “a tool radically different from the traditional user's manual” that would require a new approach to composing prose.
zh_cn: 他们展现了这样一种可能性，即在线文档可以作为“一种与传统用户手册截然不同的工具”，这将要求一种全新的写作方法。

source: They proposed three kinds of topics: “Those specific to a genre, those specific to an organization or institution, and those specific to a discipline” (Miller & Selzer, 1985, p.
zh_cn: 他们提出了三种主题：“特定体裁、特定组织机构和特定学科” (Miller & Selzer, 1985, p.

source: They provided the following causes behind the crisis in manual writing:
zh_cn: 以下是他们提出的手册写作危机的原因：

source: This specific frame displays the future of our profession as “more and more structured content and the ability to work faster and smarter with XML and DITA constructs.”
zh_cn: 这一帧画面显示着行业的未来所在，即“越来越结构化的内容，以及更快、更智能地 使用 XML 和 DITA 结构的能力”。

source: This YAML header can supply a direct value for the @id attribute that is required on the root element of a DITA topic; it can also include prolog metadata about who authored the DITA topic.
zh_cn: YAML 头可以直接提供 DITA 话题根元素所需的 @id 属性，它还包含关于 DITA 话题作者的元数据。

source: This approach also helped during the process of designing the content and element types of LwDITA, but it all started with understanding the different meanings of the term topic for the proposed standard's intended audiences of practitioners and academics.
zh_cn: 这种方法在设计LwDITA的内容和元素类型的过程中也有帮助，但是首先要理解术语主题对于提倡的标准的目标受众(从业者和学者)的不同含义。

source: This bold decision of decoupling a version of DITA from its popular document types is supported by claims that can be summarized in the following three points: 1.
zh_cn: 将 DITA 与其颇受欢迎的文档类型解耦的大胆决定源自以下三点：

source: This bold decision of decoupling a version of DITA from its popular document types is supported by claims that can be summarized in the following three points:
zh_cn: 将 DITA 与其颇受欢迎的文档类型解耦的大胆决定源自以下三点：

source: This book began at Apple Computer as a guide to the new employees and freelance writers working for the User Education group in the division that produces the Apple II family of computers.
zh_cn: 在Apple Computer的开发中，生产苹果II系列电脑的部门的用户教育组内，新员工和自由工作者都遵从这本书的指导。

source: This book is not about a specific tool or software platform: as an open standard in development, LwDITA does not depend on a vendor or “app.” Hackos explains the importance of information standards for technical communicators with the following scenario, which also applies to LwDITA:
zh_cn: 这本书并关于某一个特定的工具或软件平台：LwDITA 作为一个仍在法阵中的开放标准，不依赖于任何代理商或“应用程序”。哈克斯用以下场景解释了信息标准对技术传播工程师的重要性，该解释同样适用于 LwDITA：

source: This book treats ambitious promises of computational thinking with caution, as “there is little evidence to believe that students are learning higher-order thinking skills by learning programming” (Guzdial, 2016, p.
zh_cn: 本书对计算机思维雄心勃勃的承诺持谨慎态度，因为“几乎没有证据表明，学生通过学习编程可以掌握更高层次的思维技能” (Guzdial, 2016, p.

source: This brings the advantages of structured authoring to where people are already creating content, rather than trying to get every author onto one content platform.
zh_cn: 这给那些已经开始创作内容的人带去了结构化创作的好处，而不是试图把每个作者都召唤到一个内容平台上。

source: This builds on the lightweight model being proposed in 13076.
zh_cn: 这建立在第13076号提案提出的轻量级模型之上。

source: This chapter does not have the purpose of replacing or mirroring the technical specification (which will contain information and details for developers and information designers) for the proposed LwDITA standard.
zh_cn: 编写本章的目的不是代替提议的 LwDITA 标准的技术规范（包含适用于开发人员和信息设计人员的信息和细节内容），或者将其复述一遍。
